{
    "architectures": ["DFlashDraftModel"],
    "model_type": "dflash",
    "hidden_size": 4096,
    "intermediate_size": 12288,
    "num_hidden_layers": 5,
    "num_attention_heads": 16,
    "num_key_value_heads": 4,
    "vocab_size": 248320,
    "rms_norm_eps": 1e-6,
    "max_position_embeddings": 262144,
    "rope_theta": 10000000.0,
    "num_target_layers": 5,
    "target_hidden_size": 4096,
    "target_num_hidden_layers": 32,
    "target_layer_ids": [2, 9, 16, 23, 30],
    "mask_token_id": 248044,
    "tie_word_embeddings": false
}
