{
    "architectures": ["DFlashDraftModel"],
    "model_type": "dflash",
    "hidden_size": 2880,
    "intermediate_size": 2880,
    "num_hidden_layers": 5,
    "num_attention_heads": 64,
    "num_key_value_heads": 8,
    "head_dim": 64,
    "vocab_size": 201088,
    "rms_norm_eps": 1e-5,
    "max_position_embeddings": 131072,
    "rope_theta": 150000.0,
    "num_target_layers": 5,
    "target_hidden_size": 2880,
    "target_num_hidden_layers": 24,
    "target_layer_ids": [1, 6, 11, 16, 21],
    "mask_token_id": 199999,
    "tie_word_embeddings": false
}
